src/toir_cf/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_ПризнакПодразделенияОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_РемонтныеБригады/торо_РемонтныеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_РемонтныеБригады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсыРемонтнойБригады</name>
    <type>
      <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ВидыРемонтов/торо_ВидыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыРемонтов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УдалитьВидОбслуживанияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланГрафикППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикМероприятий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНепериодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_СписокОбъектовРегламентногоМероприятия/торо_СписокОбъектовРегламентногоМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СписокОбъектовРегламентногоМероприятия</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИндивидуальноеОбслуживаниеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_ВидыСкользящихПланов/торо_ВидыСкользящихПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыСкользящихПланов</name>
  <predefined>
    <items>
      <name>Годовой</name>
      <description>Годовой</description>
    </items>
    <items>
      <name>Долгосрочный</name>
      <description>Долгосрочный</description>
    </items>
    <items>
      <name>Оперативный</name>
      <description>Оперативный</description>
    </items>
    <items>
      <name>Среднесрочный</name>
      <description>Среднесрочный</description>
    </items>
    <items>
      <name>Стратегический</name>
      <description>Стратегический</description>
    </items>
  </predefined>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоОтображаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьПланирования</name>
    <type>
      <types>EnumRef.торо_ДетализацияПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсполнителяРабот</name>
    <type>
      <types>EnumRef.торо_ДетализацияИсполнителя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРемонтов</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/CommonForms/торо_ФормаПодбораВСписок/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивВыбранных") Тогда
		Для каждого Элемент Из Параметры.МассивВыбранных Цикл
			НС = СписокВыбораЗначений.Добавить();
			НС.ВыбранноеЗначение = Элемент;
		КонецЦикла; 
	КонецЕсли;
	
	Если Параметры.Свойство("МассивВыбранныхПодразделений") Тогда
		МассивВыбранныхПодразделений.ЗагрузитьЗначения(Параметры.МассивВыбранныхПодразделений);
	КонецЕсли; 
	
	Если Параметры.Свойство("МассивВыбранныхКонтрагентов") Тогда
		МассивВыбранныхКонтрагентов.ЗагрузитьЗначения(Параметры.МассивВыбранныхКонтрагентов);
	КонецЕсли; 
	
	Параметры.Свойство("ТипЗначений", ТипЗначений);
	Параметры.Свойство("ИспользоватьВариантУчетаИерархииЭлементов", ИспользоватьВариантУчетаИерархииЭлементов);
	Параметры.Свойство("ФОИспользоватьСкользящееПланирование", ФОИспользоватьСкользящееПланирование);
	Параметры.Свойство("Заголовок", Заголовок);
	
	Если ТипЗначений.Типы().Количество() > 0 И ТипЗначений.Типы()[0] = Тип("СправочникСсылка.торо_ВидыРемонтов") И Параметры.Свойство("ВидПлана") Тогда
	    ВидыРемонтовПлана(Параметры.ВидПлана, СписокДоступныхПодразделений);
		Элементы.СписокВыбораЗначенийВыбранноеЗначение.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПодразделений.ВыгрузитьЗначения());
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Ссылка", "СписокДоступныхПодразделений");
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.СписокВыбораЗначенийВыбранноеЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СписокВыбораЗначенийВыбранноеЗначение.ОграничениеТипа = ТипЗначений;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокВыбораЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	НС = СписокВыбораЗначений.Добавить();
	ИндексСтроки = НС.ПолучитьИдентификатор();
	СтруктураПараметр = Новый Структура("ЗакрыватьПриВыборе, Добавление", Истина, Истина);
	
	Если ТипЗначений.Типы().Количество() = 1 Тогда
		ОбработкаВыбораТипа(ТипЗначений.Типы()[0], СтруктураПараметр);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораТипа", ЭтаФорма, СтруктураПараметр);
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТипЗначений.Типы());
		СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выбор типа данных'")); 
	КонецЕсли; 	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	СтруктураПараметр = Новый Структура("ЗакрыватьПриВыборе, Добавление", Ложь, Ложь);
	Если ТипЗначений.Типы().Количество() = 1 Тогда
		ОбработкаВыбораТипа(ТипЗначений.Типы()[0], СтруктураПараметр);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораТипа", ЭтаФорма, СтруктураПараметр);
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(ТипЗначений.Типы());
		СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выбор типа данных'")); 
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	МассивВыбранных = Новый Массив;
	Для каждого Строка Из СписокВыбораЗначений Цикл
		Если ЗначениеЗаполнено(Строка.ВыбранноеЗначение) Тогда
			МассивВыбранных.Добавить(Строка.ВыбранноеЗначение);
		КонецЕсли;
	КонецЦикла; 
	ОповеститьОВыборе(МассивВыбранных);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура ОбработкаВыбораТипа(Тип, ДопПараметры) Экспорт
	
	Если ТипЗнч(Тип) = Тип("ЭлементСпискаЗначений") Тогда
		ВыбранныйТип = Тип.Значение;
	Иначе
		ВыбранныйТип = Тип;
	КонецЕсли; 
	
	Закрывать = Истина;
	ДопПараметры.Свойство("ЗакрыватьПриВыборе", Закрывать);
	Добавление = ДопПараметры.Добавление;

	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("ЗакрыватьПриВыборе", Закрывать);
	
	Если ВыбранныйТип = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				
		Если ИспользоватьВариантУчетаИерархииЭлементов И Не Добавление Тогда
			СтруктураВыбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов", ИспользоватьВариантУчетаИерархииЭлементов);
		КонецЕсли;
		
		Если ФОИспользоватьСкользящееПланирование Тогда
			СтруктураВыбора.Вставить("ФОИспользоватьСкользящееПланирование");
		КонецЕсли;
		
		ОткрытьФорму("Справочник.СтруктураПредприятия.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 

		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.торо_РемонтныеБригады") Тогда 
		
		Если МассивВыбранныхПодразделений.Количество() > 0 Тогда
			СтруктураВыбора.Вставить("Отбор", Новый Структура("Подразделение", МассивВыбранныхПодразделений.ВыгрузитьЗначения()));	
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.торо_РемонтныеБригады.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.торо_РемонтныеБригады.ПустаяСсылка");
		КонецЕсли; 
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		Если МассивВыбранныхКонтрагентов.Количество() > 0 Тогда
			СтруктураВыбора.Вставить("Отбор", Новый Структура("Контрагент",МассивВыбранныхКонтрагентов));	
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		КонецЕсли; 
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		
		Если ИспользоватьВариантУчетаИерархииЭлементов И Не Добавление Тогда
			СтруктураВыбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов", ИспользоватьВариантУчетаИерархииЭлементов);
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
		КонецЕсли; 
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
		
		Если СписокДоступныхПодразделений.Количество() > 0 Тогда
		    СтруктураОтбора = Новый Структура("Ссылка", СписокДоступныхПодразделений);
			СтруктураВыбора.Вставить("Отбор", СтруктураОтбора);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.торо_ВидыРемонтов.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли ВыбранныйТип = Тип("СправочникСсылка.торо_СписокОбъектовРегламентногоМероприятия") Тогда
		
		Если ИспользоватьВариантУчетаИерархииЭлементов И Не Добавление Тогда
			СтруктураВыбора.Вставить("ИспользоватьВариантУчетаИерархииЭлементов");
		КонецЕсли; 
		
		ОткрытьФорму("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ФормаВыбора", СтруктураВыбора, Элементы.СписокВыбораЗначений); 
		
		Если ЗначениеЗаполнено(ИндексСтроки) Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			Строка.ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.торо_СписокОбъектовРегламентногоМероприятия.ПустаяСсылка");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораЗначенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого Элемент Из ВыбранноеЗначение Цикл
			ДобавитьВыбранноеЗначениеВСписокВыбранных(Элемент);
		КонецЦикла; 
	Иначе
		ДобавитьВыбранноеЗначениеВСписокВыбранных(ВыбранноеЗначение);
	КонецЕсли; 
	
	ИндексСтроки = Неопределено;
	
КонецПроцедуры

&НаКлиенте 
Процедура ДобавитьВыбранноеЗначениеВСписокВыбранных(ВыбранноеЗначение)
	
	СтруктураПоиска = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);	
	
	Если СписокВыбораЗначений.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда		
		Если НЕ ИндексСтроки = Неопределено Тогда
			Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
			ИндексСтрокиВСпискеВыбораЗначений = СписокВыбораЗначений.Индекс(Строка);
			СписокВыбораЗначений.Удалить(ИндексСтрокиВСпискеВыбораЗначений);
		КонецЕсли;
		ИндексСтроки = Неопределено;
		Возврат;		
	КонецЕсли;
	
	Если НЕ ИндексСтроки = Неопределено Тогда
		Строка = СписокВыбораЗначений.НайтиПоИдентификатору(ИндексСтроки);
		Если Не ЗначениеЗаполнено(Строка.ВыбранноеЗначение) Тогда
			Строка.ВыбранноеЗначение = ВыбранноеЗначение;
		КонецЕсли; 
		ИндексСтроки = Неопределено;
		Возврат;
	КонецЕсли; 
	
	НС = СписокВыбораЗначений.Добавить();
	НС.ВыбранноеЗначение = ВыбранноеЗначение;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВидыРемонтовПлана(ВидПлана, СписокДоступныхПодразделений)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ВидыСкользящихПлановВидыРемонтов.ВидРемонта КАК ВидРемонта
		|ИЗ
		|	Справочник.торо_ВидыСкользящихПланов.ВидыРемонтов КАК торо_ВидыСкользящихПлановВидыРемонтов
		|ГДЕ
		|	торо_ВидыСкользящихПлановВидыРемонтов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВидПлана);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДоступныхПодразделений.Добавить(ВыборкаДетальныеЗаписи.ВидРемонта);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
